;******************************************************************************
;* PRU C/C++ Codegen                                              Unix v2.2.1 *
;* Date/Time created: Mon Feb  5 19:40:30 2018                                *
;******************************************************************************
	.compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_version=3 --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("main.cpp")
	.dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.2.1 Copyright (c) 2012-2017 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/elcritch/projects/bessel/pru_example/pru/1")
	.global	__PRU_CREG_PRU_CFG
	.global	__PRU_CREG_PRU_INTC

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/elcritch/.nerves/artifacts/toolchain_extras_pru_cgt-linux_x86_64-0.2.0/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$1237)

$C$DW$3	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$3, DW_AT_type(*$C$DW$T$1240)


	.dwpsn	file "main.cpp",line 108,column 9,is_stmt,isa 0
        SBBO      &r15, r14, 0, 4       ; [] |108| $O$K31,$O$K29
;* --------------------------------------------------------------------------*
||$C$L5||:    
	.dwpsn	file "main.cpp",line 100,column 30,is_stmt,isa 0
        SUB       r0, r0, 0x01          ; [] |100| i,i
        QBNE      ||$C$L4||, r0, 0x00   ; [] |100| i
;* --------------------------------------------------------------------------*
        LBBO      &r1, r2, 0, 4         ; [] $O$v2,settings
        JMP       ||$C$L1||             ; [] 
	.dwattr $C$DW$250, DW_AT_TI_end_file("main.cpp")
	.dwattr $C$DW$250, DW_AT_TI_end_line(0x70)
	.dwattr $C$DW$250, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$250

	.sect	".text:main"
	.clink
	.global	||main||

$C$DW$254	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$254, DW_AT_name("main")
	.dwattr $C$DW$254, DW_AT_low_pc(||main||)
	.dwattr $C$DW$254, DW_AT_high_pc(0x00)
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("main")
	.dwattr $C$DW$254, DW_AT_external
	.dwattr $C$DW$254, DW_AT_TI_begin_file("main.cpp")
	.dwattr $C$DW$254, DW_AT_TI_begin_line(0x73)
	.dwattr $C$DW$254, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$254, DW_AT_decl_file("main.cpp")
	.dwattr $C$DW$254, DW_AT_decl_line(0x73)
	.dwattr $C$DW$254, DW_AT_decl_column(0x06)
	.dwattr $C$DW$254, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "main.cpp",line 116,column 1,is_stmt,address ||main||,isa 0

	.dwfde $C$DW$CIE, ||main||

;***************************************************************
;* FNAME: main                          FR SIZE:   0           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Auto,  0 SOE     *
;***************************************************************

||main||:
;* --------------------------------------------------------------------------*
;* r0_0  assigned to $O$C1
	.dwcfi	cfa_offset, 0
        MOV       r3.w0, r3.w2          ; [] 
	.dwcfi	save_reg_to_reg, 14, 12
	.dwcfi	save_reg_to_reg, 15, 13
	.dwpsn	file "main.cpp",line 118,column 2,is_stmt,isa 0
        LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [] |118| CT_CFG
        CLR       r0, r0, 0x00000004    ; [] |118| 
        SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [] |118| CT_CFG
	.dwpsn	file "main.cpp",line 119,column 2,is_stmt,isa 0
        LDI32     r0, ||CT_INTC||+36    ; [] |119| $O$C1,CT_INTC
        LDI32     r1, 0xfffffc00        ; [] |119| 
        LBBO      &r14, r0, 0, 4        ; [] |119| $O$C1
        AND       r1, r14, r1           ; [] |119| 
        SET       r1, r1, 0x00000004    ; [] |119| 
        SBBO      &r1, r0, 0, 4         ; [] |119| $O$C1
	.dwpsn	file "main.cpp",line 123,column 3,is_stmt,isa 0
$C$DW$255	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$255, DW_AT_low_pc(0x00)
	.dwattr $C$DW$255, DW_AT_name("_Z12blinkExamplev")
	.dwattr $C$DW$255, DW_AT_TI_call

        JAL       r3.w2, ||_Z12blinkExamplev|| ; [] |123| _Z12blinkExamplev
;***	; the preceding call never returns
$C$DW$256	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$256, DW_AT_low_pc(0x00)
	.dwattr $C$DW$256, DW_AT_TI_return

        JMP       r3.w0                 ; [] 
	.dwattr $C$DW$254, DW_AT_TI_end_file("main.cpp")
	.dwattr $C$DW$254, DW_AT_TI_end_line(0x81)
	.dwattr $C$DW$254, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$254

	.sect	".text:_Z22rx_scratchpad_settingsv"
	.clink
	.global	||_Z22rx_scratchpad_settingsv||

$C$DW$257	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$257, DW_AT_name("_Z22rx_scratchpad_settingsv")
	.dwattr $C$DW$257, DW_AT_low_pc(||_Z22rx_scratchpad_settingsv||)
	.dwattr $C$DW$257, DW_AT_high_pc(0x00)
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_Z22rx_scratchpad_settingsv")
	.dwattr $C$DW$257, DW_AT_external
	.dwattr $C$DW$257, DW_AT_TI_begin_file("main.cpp")
	.dwattr $C$DW$257, DW_AT_TI_begin_line(0x39)
	.dwattr $C$DW$257, DW_AT_TI_begin_column(0x01)
	.dwattr $C$DW$257, DW_AT_decl_file("main.cpp")
	.dwattr $C$DW$257, DW_AT_decl_line(0x39)
	.dwattr $C$DW$257, DW_AT_decl_column(0x01)
	.dwattr $C$DW$257, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "main.cpp",line 57,column 1,is_stmt,address ||_Z22rx_scratchpad_settingsv||,isa 0

	.dwfde $C$DW$CIE, ||_Z22rx_scratchpad_settingsv||

;***************************************************************
;* FNAME: _Z22rx_scratchpad_settingsv   FR SIZE:   0           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Auto,  0 SOE     *
;***************************************************************

||_Z22rx_scratchpad_settingsv||:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
        XIN       0x0a, &r14.b0, 0x04   ; [] |57| 
$C$DW$258	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$258, DW_AT_low_pc(0x00)
	.dwattr $C$DW$258, DW_AT_TI_return

        JMP       r3.w2                 ; [] 
	.dwattr $C$DW$257, DW_AT_TI_end_file("main.cpp")
	.dwattr $C$DW$257, DW_AT_TI_end_line(0x39)
	.dwattr $C$DW$257, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$257


;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$259, DW_AT_name("REVID")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("REVID")
	.dwattr $C$DW$259, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$259, DW_AT_bit_size(0x20)
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$259, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$259, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$259, DW_AT_decl_column(0x0d)


$C$DW$5	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$5, DW_AT_name("_ZN6pruCfg4__C1Ut_aSERKS1_")
	.dwattr $C$DW$5, DW_AT_declaration
	.dwattr $C$DW$5, DW_AT_TI_symbol_name("_ZN6pruCfg4__C1Ut_aSERKS1_")
	.dwattr $C$DW$5, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$260	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$23)

	.dwendtag $C$DW$5

	.dwattr $C$DW$T$25, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$25

$C$DW$T$22	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$25)

$C$DW$T$23	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_address_class(0x20)

$C$DW$T$479	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$479, DW_AT_type(*$C$DW$T$25)

$C$DW$T$21	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$21, DW_AT_address_class(0x20)


$C$DW$T$24	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$261	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$23)

	.dwendtag $C$DW$T$24


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$262, DW_AT_name("IDLE_MODE")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("IDLE_MODE")
	.dwattr $C$DW$262, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$262, DW_AT_bit_size(0x02)
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$262, DW_AT_decl_line(0x37)
	.dwattr $C$DW$262, DW_AT_decl_column(0x0d)

$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$263, DW_AT_name("STANDBY_MODE")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("STANDBY_MODE")
	.dwattr $C$DW$263, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$263, DW_AT_bit_size(0x02)
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$263, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$263, DW_AT_decl_line(0x38)
	.dwattr $C$DW$263, DW_AT_decl_column(0x0d)

$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$264, DW_AT_name("STANDBY_INIT")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("STANDBY_INIT")
	.dwattr $C$DW$264, DW_AT_bit_offset(0x1b)
	.dwattr $C$DW$264, DW_AT_bit_size(0x01)
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$264, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$264, DW_AT_decl_line(0x39)
	.dwattr $C$DW$264, DW_AT_decl_column(0x0d)

$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$265, DW_AT_name("SUB_MWAIT")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("SUB_MWAIT")
	.dwattr $C$DW$265, DW_AT_bit_offset(0x1a)
	.dwattr $C$DW$265, DW_AT_bit_size(0x01)
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$265, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$265, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$265, DW_AT_decl_column(0x0d)

$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$266, DW_AT_name("rsvd6")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("rsvd6")
	.dwattr $C$DW$266, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$266, DW_AT_bit_size(0x1a)
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$266, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$266, DW_AT_decl_column(0x0d)


$C$DW$6	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$6, DW_AT_name("_ZN6pruCfg4__C2Ut_aSERKS1_")
	.dwattr $C$DW$6, DW_AT_declaration
	.dwattr $C$DW$6, DW_AT_TI_symbol_name("_ZN6pruCfg4__C2Ut_aSERKS1_")
	.dwattr $C$DW$6, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$267	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$28)

	.dwendtag $C$DW$6

	.dwattr $C$DW$T$30, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$30

$C$DW$T$27	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$30)

$C$DW$T$28	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x20)

$C$DW$T$486	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$486, DW_AT_type(*$C$DW$T$30)

$C$DW$T$26	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x20)


$C$DW$T$29	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$268	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$28)

	.dwendtag $C$DW$T$29


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$269, DW_AT_name("PRU0_GPI_MODE")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
	.dwattr $C$DW$269, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$269, DW_AT_bit_size(0x02)
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$269, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0x45)
	.dwattr $C$DW$269, DW_AT_decl_column(0x0d)

$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$270, DW_AT_name("PRU0_GPI_CLK_MODE")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
	.dwattr $C$DW$270, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$270, DW_AT_bit_size(0x01)
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$270, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x46)
	.dwattr $C$DW$270, DW_AT_decl_column(0x0d)

$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$271, DW_AT_name("PRU0_GPI_DIV0")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
	.dwattr $C$DW$271, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$271, DW_AT_bit_size(0x05)
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$271, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x47)
	.dwattr $C$DW$271, DW_AT_decl_column(0x0d)

$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$272, DW_AT_name("PRU0_GPI_DIV1")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
	.dwattr $C$DW$272, DW_AT_bit_offset(0x13)
	.dwattr $C$DW$272, DW_AT_bit_size(0x05)
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$272, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x48)
	.dwattr $C$DW$272, DW_AT_decl_column(0x0d)

$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$273, DW_AT_name("PRU0_GPI_SB")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("PRU0_GPI_SB")
	.dwattr $C$DW$273, DW_AT_bit_offset(0x12)
	.dwattr $C$DW$273, DW_AT_bit_size(0x01)
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$273, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x49)
	.dwattr $C$DW$273, DW_AT_decl_column(0x0d)

$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$274, DW_AT_name("PRU0_GPO_MODE")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
	.dwattr $C$DW$274, DW_AT_bit_offset(0x11)
	.dwattr $C$DW$274, DW_AT_bit_size(0x01)
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$274, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$274, DW_AT_decl_column(0x0d)

$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$275, DW_AT_name("PRU0_GPO_DIV0")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
	.dwattr $C$DW$275, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$275, DW_AT_bit_size(0x05)
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$275, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$275, DW_AT_decl_column(0x0d)

$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$276, DW_AT_name("PRU0_GPO_DIV1")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
	.dwattr $C$DW$276, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$276, DW_AT_bit_size(0x05)
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$276, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$276, DW_AT_decl_column(0x0d)

$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$277, DW_AT_name("PRU0_GPO_SH_SEL")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
	.dwattr $C$DW$277, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$277, DW_AT_bit_size(0x01)
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$277, DW_AT_decl_column(0x0d)

$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$278, DW_AT_name("rsvd26")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("rsvd26")
	.dwattr $C$DW$278, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$278, DW_AT_bit_size(0x06)
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$278, DW_AT_decl_column(0x0d)


$C$DW$7	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$7, DW_AT_name("_ZN6pruCfg4__C3Ut_aSERKS1_")
	.dwattr $C$DW$7, DW_AT_declaration
	.dwattr $C$DW$7, DW_AT_TI_symbol_name("_ZN6pruCfg4__C3Ut_aSERKS1_")
	.dwattr $C$DW$7, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$279	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$33)

	.dwendtag $C$DW$7

	.dwattr $C$DW$T$35, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x44)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$35

$C$DW$T$32	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$35)

$C$DW$T$33	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$33, DW_AT_address_class(0x20)

$C$DW$T$493	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$493, DW_AT_type(*$C$DW$T$35)

$C$DW$T$31	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)


$C$DW$T$34	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$280	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$33)

	.dwendtag $C$DW$T$34


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$281, DW_AT_name("PRU1_GPI_MODE")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
	.dwattr $C$DW$281, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$281, DW_AT_bit_size(0x02)
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x58)
	.dwattr $C$DW$281, DW_AT_decl_column(0x0d)

$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$282, DW_AT_name("PRU1_GPI_CLK_MODE")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
	.dwattr $C$DW$282, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$282, DW_AT_bit_size(0x01)
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x59)
	.dwattr $C$DW$282, DW_AT_decl_column(0x0d)

$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$283, DW_AT_name("PRU1_GPI_DIV0")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
	.dwattr $C$DW$283, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$283, DW_AT_bit_size(0x05)
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$283, DW_AT_decl_column(0x0d)

$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$284, DW_AT_name("PRU1_GPI_DIV1")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
	.dwattr $C$DW$284, DW_AT_bit_offset(0x13)
	.dwattr $C$DW$284, DW_AT_bit_size(0x05)
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$284, DW_AT_decl_column(0x0d)

$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$285, DW_AT_name("PRU1_GPI_SB")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("PRU1_GPI_SB")
	.dwattr $C$DW$285, DW_AT_bit_offset(0x12)
	.dwattr $C$DW$285, DW_AT_bit_size(0x01)
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$285, DW_AT_decl_column(0x0d)

$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$286, DW_AT_name("PRU1_GPO_MODE")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
	.dwattr $C$DW$286, DW_AT_bit_offset(0x11)
	.dwattr $C$DW$286, DW_AT_bit_size(0x01)
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$286, DW_AT_decl_column(0x0d)

$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$287, DW_AT_name("PRU1_GPO_DIV0")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
	.dwattr $C$DW$287, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$287, DW_AT_bit_size(0x05)
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$287, DW_AT_decl_column(0x0d)

$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$288, DW_AT_name("PRU1_GPO_DIV1")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
	.dwattr $C$DW$288, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$288, DW_AT_bit_size(0x05)
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$288, DW_AT_decl_column(0x0d)

$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$289, DW_AT_name("PRU1_GPO_SH_SEL")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
	.dwattr $C$DW$289, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$289, DW_AT_bit_size(0x01)
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x60)
	.dwattr $C$DW$289, DW_AT_decl_column(0x0d)

$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$290, DW_AT_name("rsvd26")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("rsvd26")
	.dwattr $C$DW$290, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$290, DW_AT_bit_size(0x06)
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x61)
	.dwattr $C$DW$290, DW_AT_decl_column(0x0d)


$C$DW$8	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$8, DW_AT_name("_ZN6pruCfg4__C4Ut_aSERKS1_")
	.dwattr $C$DW$8, DW_AT_declaration
	.dwattr $C$DW$8, DW_AT_TI_symbol_name("_ZN6pruCfg4__C4Ut_aSERKS1_")
	.dwattr $C$DW$8, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$291	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$38)

	.dwendtag $C$DW$8

	.dwattr $C$DW$T$40, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x57)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$40

$C$DW$T$37	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$40)

$C$DW$T$38	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$38, DW_AT_address_class(0x20)

$C$DW$T$500	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$500, DW_AT_type(*$C$DW$T$40)

$C$DW$T$36	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$36, DW_AT_address_class(0x20)


$C$DW$T$39	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$292	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$38)

	.dwendtag $C$DW$T$39


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$293, DW_AT_name("PRU0_CLK_STOP_REQ")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
	.dwattr $C$DW$293, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$293, DW_AT_bit_size(0x01)
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$293, DW_AT_decl_column(0x0d)

$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$294, DW_AT_name("PRU0_CLK_STOP_ACK")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
	.dwattr $C$DW$294, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$294, DW_AT_bit_size(0x01)
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$294, DW_AT_decl_column(0x0d)

$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$295, DW_AT_name("PRU0_CLK_EN")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("PRU0_CLK_EN")
	.dwattr $C$DW$295, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$295, DW_AT_bit_size(0x01)
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$295, DW_AT_decl_column(0x0d)

$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$296, DW_AT_name("PRU1_CLK_STOP_REQ")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
	.dwattr $C$DW$296, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$296, DW_AT_bit_size(0x01)
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$296, DW_AT_decl_column(0x0d)

$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$297, DW_AT_name("PRU1_CLK_STOP_ACK")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
	.dwattr $C$DW$297, DW_AT_bit_offset(0x1b)
	.dwattr $C$DW$297, DW_AT_bit_size(0x01)
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$297, DW_AT_decl_column(0x0d)

$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$298, DW_AT_name("PRU1_CLK_EN")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("PRU1_CLK_EN")
	.dwattr $C$DW$298, DW_AT_bit_offset(0x1a)
	.dwattr $C$DW$298, DW_AT_bit_size(0x01)
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x70)
	.dwattr $C$DW$298, DW_AT_decl_column(0x0d)

$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$299, DW_AT_name("INTC_CLK_STOP_REQ")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
	.dwattr $C$DW$299, DW_AT_bit_offset(0x19)
	.dwattr $C$DW$299, DW_AT_bit_size(0x01)
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x71)
	.dwattr $C$DW$299, DW_AT_decl_column(0x0d)

$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$300, DW_AT_name("INTC_CLK_STOP_ACK")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
	.dwattr $C$DW$300, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$300, DW_AT_bit_size(0x01)
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x72)
	.dwattr $C$DW$300, DW_AT_decl_column(0x0d)

$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$301, DW_AT_name("INTC_CLK_EN")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("INTC_CLK_EN")
	.dwattr $C$DW$301, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$301, DW_AT_bit_size(0x01)
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x73)
	.dwattr $C$DW$301, DW_AT_decl_column(0x0d)

$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$302, DW_AT_name("UART_CLK_STOP_REQ")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
	.dwattr $C$DW$302, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$302, DW_AT_bit_size(0x01)
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x74)
	.dwattr $C$DW$302, DW_AT_decl_column(0x0d)

$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$303, DW_AT_name("UART_CLK_STOP_ACK")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
	.dwattr $C$DW$303, DW_AT_bit_offset(0x15)
	.dwattr $C$DW$303, DW_AT_bit_size(0x01)
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x75)
	.dwattr $C$DW$303, DW_AT_decl_column(0x0d)

$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$304, DW_AT_name("UART_CLK_EN")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("UART_CLK_EN")
	.dwattr $C$DW$304, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$304, DW_AT_bit_size(0x01)
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x76)
	.dwattr $C$DW$304, DW_AT_decl_column(0x0d)

$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$305, DW_AT_name("ECAP_CLK_STOP_REQ")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
	.dwattr $C$DW$305, DW_AT_bit_offset(0x13)
	.dwattr $C$DW$305, DW_AT_bit_size(0x01)
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x77)
	.dwattr $C$DW$305, DW_AT_decl_column(0x0d)

$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$306, DW_AT_name("ECAP_CLK_STOP_ACK")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
	.dwattr $C$DW$306, DW_AT_bit_offset(0x12)
	.dwattr $C$DW$306, DW_AT_bit_size(0x01)
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x78)
	.dwattr $C$DW$306, DW_AT_decl_column(0x0d)

$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$307, DW_AT_name("ECAP_CLK_EN")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("ECAP_CLK_EN")
	.dwattr $C$DW$307, DW_AT_bit_offset(0x11)
	.dwattr $C$DW$307, DW_AT_bit_size(0x01)
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x79)
	.dwattr $C$DW$307, DW_AT_decl_column(0x0d)

$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$308, DW_AT_name("IEP_CLK_STOP_REQ")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
	.dwattr $C$DW$308, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$308, DW_AT_bit_size(0x01)
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$308, DW_AT_decl_column(0x0d)

$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$309, DW_AT_name("IEP_CLK_STOP_ACK")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
	.dwattr $C$DW$309, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$309, DW_AT_bit_size(0x01)
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$309, DW_AT_decl_column(0x0d)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$310, DW_AT_name("IEP_CLK_EN")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("IEP_CLK_EN")
	.dwattr $C$DW$310, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$310, DW_AT_bit_size(0x01)
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$310, DW_AT_decl_column(0x0d)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$311, DW_AT_name("rsvd18")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("rsvd18")
	.dwattr $C$DW$311, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$311, DW_AT_bit_size(0x0e)
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$311, DW_AT_decl_column(0x0d)


$C$DW$9	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$9, DW_AT_name("_ZN6pruCfg4__C5Ut_aSERKS1_")
	.dwattr $C$DW$9, DW_AT_declaration
	.dwattr $C$DW$9, DW_AT_TI_symbol_name("_ZN6pruCfg4__C5Ut_aSERKS1_")
	.dwattr $C$DW$9, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$312	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$43)

	.dwendtag $C$DW$9

	.dwattr $C$DW$T$45, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$45

$C$DW$T$42	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$45)

$C$DW$T$43	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$43, DW_AT_address_class(0x20)

$C$DW$T$507	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$507, DW_AT_type(*$C$DW$T$45)

$C$DW$T$41	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$41, DW_AT_address_class(0x20)


$C$DW$T$44	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$313	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$43)

	.dwendtag $C$DW$T$44


$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$314, DW_AT_name("PRU0_IMEM_PE_RAW")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
	.dwattr $C$DW$314, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$314, DW_AT_bit_size(0x04)
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x87)
	.dwattr $C$DW$314, DW_AT_decl_column(0x0d)

$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$315, DW_AT_name("PRU0_DMEM_PE_RAW")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
	.dwattr $C$DW$315, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$315, DW_AT_bit_size(0x04)
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x88)
	.dwattr $C$DW$315, DW_AT_decl_column(0x0d)

$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$316, DW_AT_name("PRU1_IMEM_PE_RAW")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
	.dwattr $C$DW$316, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$316, DW_AT_bit_size(0x04)
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x89)
	.dwattr $C$DW$316, DW_AT_decl_column(0x0d)

$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$317, DW_AT_name("PRU1_DMEM_PE_RAW")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
	.dwattr $C$DW$317, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$317, DW_AT_bit_size(0x04)
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$317, DW_AT_decl_column(0x0d)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$318, DW_AT_name("RAM_PE_RAW")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("RAM_PE_RAW")
	.dwattr $C$DW$318, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$318, DW_AT_bit_size(0x04)
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$318, DW_AT_decl_column(0x0d)

$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$319, DW_AT_name("rsvd20")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("rsvd20")
	.dwattr $C$DW$319, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$319, DW_AT_bit_size(0x0c)
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$319, DW_AT_decl_column(0x0d)


$C$DW$10	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$10, DW_AT_name("_ZN6pruCfg4__C6Ut_aSERKS1_")
	.dwattr $C$DW$10, DW_AT_declaration
	.dwattr $C$DW$10, DW_AT_TI_symbol_name("_ZN6pruCfg4__C6Ut_aSERKS1_")
	.dwattr $C$DW$10, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$320	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$48)

	.dwendtag $C$DW$10

	.dwattr $C$DW$T$50, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$50

$C$DW$T$47	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$50)

$C$DW$T$48	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$48, DW_AT_address_class(0x20)

$C$DW$T$514	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$514, DW_AT_type(*$C$DW$T$50)

$C$DW$T$46	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$46, DW_AT_address_class(0x20)


$C$DW$T$49	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$321	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$48)

	.dwendtag $C$DW$T$49


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$322, DW_AT_name("PRU0_IMEM_PE")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
	.dwattr $C$DW$322, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$322, DW_AT_bit_size(0x04)
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x96)
	.dwattr $C$DW$322, DW_AT_decl_column(0x0d)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$323, DW_AT_name("PRU0_DMEM_PE")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
	.dwattr $C$DW$323, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$323, DW_AT_bit_size(0x04)
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x97)
	.dwattr $C$DW$323, DW_AT_decl_column(0x0d)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$324, DW_AT_name("PRU1_IMEM_PE")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
	.dwattr $C$DW$324, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$324, DW_AT_bit_size(0x04)
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x98)
	.dwattr $C$DW$324, DW_AT_decl_column(0x0d)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$325, DW_AT_name("PRU1_DMEM_PE")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
	.dwattr $C$DW$325, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$325, DW_AT_bit_size(0x04)
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x99)
	.dwattr $C$DW$325, DW_AT_decl_column(0x0d)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$326, DW_AT_name("RAM_PE")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("RAM_PE")
	.dwattr $C$DW$326, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$326, DW_AT_bit_size(0x04)
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$326, DW_AT_decl_column(0x0d)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$327, DW_AT_name("rsvd20")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("rsvd20")
	.dwattr $C$DW$327, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$327, DW_AT_bit_size(0x0c)
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$327, DW_AT_decl_column(0x0d)


$C$DW$11	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$11, DW_AT_name("_ZN6pruCfg4__C7Ut_aSERKS1_")
	.dwattr $C$DW$11, DW_AT_declaration
	.dwattr $C$DW$11, DW_AT_TI_symbol_name("_ZN6pruCfg4__C7Ut_aSERKS1_")
	.dwattr $C$DW$11, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$328	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$53)

	.dwendtag $C$DW$11

	.dwattr $C$DW$T$55, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x95)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$55

$C$DW$T$52	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$55)

$C$DW$T$53	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_address_class(0x20)

$C$DW$T$521	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$521, DW_AT_type(*$C$DW$T$55)

$C$DW$T$51	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$51, DW_AT_address_class(0x20)


$C$DW$T$54	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$329	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$53)

	.dwendtag $C$DW$T$54


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$330, DW_AT_name("PRU0_IMEM_PE_SET")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
	.dwattr $C$DW$330, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$330, DW_AT_bit_size(0x04)
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$330, DW_AT_decl_column(0x0d)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$331, DW_AT_name("PRU0_DMEM_PE_SET")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
	.dwattr $C$DW$331, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$331, DW_AT_bit_size(0x04)
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$331, DW_AT_decl_column(0x0d)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$332, DW_AT_name("PRU1_IMEM_PE_SET")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
	.dwattr $C$DW$332, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$332, DW_AT_bit_size(0x04)
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$332, DW_AT_decl_column(0x0d)

$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$333, DW_AT_name("PRU1_DMEM_PE_SET")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
	.dwattr $C$DW$333, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$333, DW_AT_bit_size(0x04)
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$333, DW_AT_decl_column(0x0d)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$334, DW_AT_name("RAM_PE_SET")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("RAM_PE_SET")
	.dwattr $C$DW$334, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$334, DW_AT_bit_size(0x04)
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$334, DW_AT_decl_column(0x0d)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$335, DW_AT_name("rsvd20")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("rsvd20")
	.dwattr $C$DW$335, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$335, DW_AT_bit_size(0x0c)
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$335, DW_AT_decl_column(0x0d)


$C$DW$12	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$12, DW_AT_name("_ZN6pruCfg4")
	.dwattr $C$DW$12, DW_AT_declaration
	.dwattr $C$DW$12, DW_AT_TI_symbol_name("_ZN6pruCfg4__C8Ut_aSERKS1_")
	.dwattr $C$DW$12, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$336	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$58)

	.dwendtag $C$DW$12

	.dwattr $C$DW$T$60, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$60

$C$DW$T$57	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$60)

$C$DW$T$58	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_address_class(0x20)

$C$DW$T$528	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$528, DW_AT_type(*$C$DW$T$60)

$C$DW$T$56	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$56, DW_AT_address_class(0x20)


$C$DW$T$59	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$337	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$58)

	.dwendtag $C$DW$T$59


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$338, DW_AT_name("PRU0_IMEM_PE_CLR")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
	.dwattr $C$DW$338, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$338, DW_AT_bit_size(0x04)
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$338, DW_AT_decl_column(0x0d)

$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$339, DW_AT_name("PRU0_DMEM_PE_CLR")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
	.dwattr $C$DW$339, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$339, DW_AT_bit_size(0x04)
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$339, DW_AT_decl_column(0x0d)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$340, DW_AT_name("PRU1_IMEM_PE_CLR")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
	.dwattr $C$DW$340, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$340, DW_AT_bit_size(0x04)
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$340, DW_AT_decl_column(0x0d)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$341, DW_AT_name("PRU1_DMEM_PE_CLR")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
	.dwattr $C$DW$341, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$341, DW_AT_bit_size(0x04)
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$341, DW_AT_decl_column(0x0d)

$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$342, DW_AT_name("rsvd16")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("rsvd16")
	.dwattr $C$DW$342, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$342, DW_AT_bit_size(0x10)
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$342, DW_AT_decl_column(0x0d)


$C$DW$13	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$13, DW_AT_name("_ZN6pruCfg4")
	.dwattr $C$DW$13, DW_AT_declaration
	.dwattr $C$DW$13, DW_AT_TI_symbol_name("_ZN6pruCfg4__C9Ut_aSERKS1_")
	.dwattr $C$DW$13, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$343	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$63)

	.dwendtag $C$DW$13

	.dwattr $C$DW$T$65, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$65

$C$DW$T$62	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$65)

$C$DW$T$63	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_address_class(0x20)

$C$DW$T$535	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$535, DW_AT_type(*$C$DW$T$65)

$C$DW$T$61	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$61, DW_AT_address_class(0x20)


$C$DW$T$64	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$344	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$63)

	.dwendtag $C$DW$T$64


$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x04)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$345, DW_AT_name("PMAO_PRU0")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("PMAO_PRU0")
	.dwattr $C$DW$345, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$345, DW_AT_bit_size(0x01)
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$345, DW_AT_decl_column(0x0d)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$346, DW_AT_name("PMAO_PRU1")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("PMAO_PRU1")
	.dwattr $C$DW$346, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$346, DW_AT_bit_size(0x01)
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$346, DW_AT_decl_column(0x0d)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$347, DW_AT_name("rsvd2")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("rsvd2")
	.dwattr $C$DW$347, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$347, DW_AT_bit_size(0x1e)
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$347, DW_AT_decl_column(0x0d)


$C$DW$14	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$14, DW_AT_name("_ZN6pruCfg5__C10Ut_aSERKS1_")
	.dwattr $C$DW$14, DW_AT_declaration
	.dwattr $C$DW$14, DW_AT_TI_symbol_name("_ZN6pruCfg5__C10Ut_aSERKS1_")
	.dwattr $C$DW$14, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$348	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$68)

	.dwendtag $C$DW$14

	.dwattr $C$DW$T$70, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$70

$C$DW$T$67	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$70)

$C$DW$T$68	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_address_class(0x20)

$C$DW$T$542	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$542, DW_AT_type(*$C$DW$T$70)

$C$DW$T$66	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$66, DW_AT_address_class(0x20)


$C$DW$T$69	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$349	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$68)

	.dwendtag $C$DW$T$69


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$350, DW_AT_name("OCP_EN")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("OCP_EN")
	.dwattr $C$DW$350, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$350, DW_AT_bit_size(0x01)
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$350, DW_AT_decl_column(0x0d)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$351, DW_AT_name("rsvd1")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("rsvd1")
	.dwattr $C$DW$351, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$351, DW_AT_bit_size(0x1f)
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$351, DW_AT_decl_column(0x0d)


$C$DW$15	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$15, DW_AT_name("_ZN6pruCfg5")
	.dwattr $C$DW$15, DW_AT_declaration
	.dwattr $C$DW$15, DW_AT_TI_symbol_name("_ZN6pruCfg5__C11Ut_aSERKS1_")
	.dwattr $C$DW$15, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$352	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$73)

	.dwendtag $C$DW$15

	.dwattr $C$DW$T$75, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$75

$C$DW$T$72	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$75)

$C$DW$T$73	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_address_class(0x20)

$C$DW$T$549	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$549, DW_AT_type(*$C$DW$T$75)

$C$DW$T$71	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$71, DW_AT_address_class(0x20)


$C$DW$T$74	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$353	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$73)

	.dwendtag $C$DW$T$74


$C$DW$T$80	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$354, DW_AT_name("PRU1_PAD_HP_EN")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
	.dwattr $C$DW$354, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$354, DW_AT_bit_size(0x01)
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0xde)
	.dwattr $C$DW$354, DW_AT_decl_column(0x0d)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$355, DW_AT_name("XFR_SHIFT_EN")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
	.dwattr $C$DW$355, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$355, DW_AT_bit_size(0x01)
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$355, DW_AT_decl_column(0x0d)

$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$356, DW_AT_name("rsvd2")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("rsvd2")
	.dwattr $C$DW$356, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$356, DW_AT_bit_size(0x1e)
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$356, DW_AT_decl_column(0x0d)


$C$DW$16	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$16, DW_AT_name("_ZN6pruCfg5__C12Ut_aSERKS1_")
	.dwattr $C$DW$16, DW_AT_declaration
	.dwattr $C$DW$16, DW_AT_TI_symbol_name("_ZN6pruCfg5__C12Ut_aSERKS1_")
	.dwattr $C$DW$16, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$357	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$78)

	.dwendtag $C$DW$16

	.dwattr $C$DW$T$80, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$80, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$T$80, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$80

$C$DW$T$77	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$80)

$C$DW$T$78	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$78, DW_AT_address_class(0x20)

$C$DW$T$556	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$556, DW_AT_type(*$C$DW$T$80)

$C$DW$T$76	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$76, DW_AT_address_class(0x20)


$C$DW$T$79	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$358	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$78)

	.dwendtag $C$DW$T$79


$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x04)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$359, DW_AT_name("PIN_MUX_SEL")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("PIN_MUX_SEL")
	.dwattr $C$DW$359, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$359, DW_AT_bit_size(0x08)
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0xec)
	.dwattr $C$DW$359, DW_AT_decl_column(0x0d)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$360, DW_AT_name("rsvd2")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("rsvd2")
	.dwattr $C$DW$360, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$360, DW_AT_bit_size(0x18)
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0xed)
	.dwattr $C$DW$360, DW_AT_decl_column(0x0d)


$C$DW$17	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$17, DW_AT_name("_ZN6pruCfg5__C13Ut_aSERKS1_")
	.dwattr $C$DW$17, DW_AT_declaration
	.dwattr $C$DW$17, DW_AT_TI_symbol_name("_ZN6pruCfg5__C13Ut_aSERKS1_")
	.dwattr $C$DW$17, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$361	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$83)

	.dwendtag $C$DW$17

	.dwattr $C$DW$T$85, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_cfg.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$85

$C$DW$T$82	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$85)

$C$DW$T$83	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$83, DW_AT_address_class(0x20)

$C$DW$T$563	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$563, DW_AT_type(*$C$DW$T$85)

$C$DW$T$81	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$81, DW_AT_address_class(0x20)


$C$DW$T$84	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$362	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$83)

	.dwendtag $C$DW$T$84


$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x04)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$363, DW_AT_name("REV_MINOR")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("REV_MINOR")
	.dwattr $C$DW$363, DW_AT_bit_offset(0x1a)
	.dwattr $C$DW$363, DW_AT_bit_size(0x06)
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$363, DW_AT_decl_column(0x0d)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$364, DW_AT_name("REV_CUSTOM")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("REV_CUSTOM")
	.dwattr $C$DW$364, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$364, DW_AT_bit_size(0x02)
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$364, DW_AT_decl_column(0x0d)

$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$365, DW_AT_name("REV_MAJOR")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("REV_MAJOR")
	.dwattr $C$DW$365, DW_AT_bit_offset(0x15)
	.dwattr $C$DW$365, DW_AT_bit_size(0x03)
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$365, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$365, DW_AT_decl_column(0x0d)

$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$366, DW_AT_name("REV_RTL")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("REV_RTL")
	.dwattr $C$DW$366, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$366, DW_AT_bit_size(0x05)
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$366, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x30)
	.dwattr $C$DW$366, DW_AT_decl_column(0x0d)

$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$367, DW_AT_name("REV_MODULE")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("REV_MODULE")
	.dwattr $C$DW$367, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$367, DW_AT_bit_size(0x0c)
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x31)
	.dwattr $C$DW$367, DW_AT_decl_column(0x0d)

$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$368, DW_AT_name("rsvd28")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("rsvd28")
	.dwattr $C$DW$368, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$368, DW_AT_bit_size(0x02)
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x32)
	.dwattr $C$DW$368, DW_AT_decl_column(0x0d)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$369, DW_AT_name("REV_SCHEME")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("REV_SCHEME")
	.dwattr $C$DW$369, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$369, DW_AT_bit_size(0x02)
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x33)
	.dwattr $C$DW$369, DW_AT_decl_column(0x0d)


$C$DW$18	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$18, DW_AT_name("_ZN7pruIntc5__C14Ut_aSERKS1_")
	.dwattr $C$DW$18, DW_AT_declaration
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("_ZN7pruIntc5__C14Ut_aSERKS1_")
	.dwattr $C$DW$18, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$370	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$88)

	.dwendtag $C$DW$18

	.dwattr $C$DW$T$90, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$90

$C$DW$T$87	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$90)

$C$DW$T$88	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_address_class(0x20)

$C$DW$T$570	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$570, DW_AT_type(*$C$DW$T$90)

$C$DW$T$86	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$86, DW_AT_address_class(0x20)


$C$DW$T$89	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$371	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$88)

	.dwendtag $C$DW$T$89


$C$DW$T$95	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$95, DW_AT_byte_size(0x04)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$372, DW_AT_name("rsvd0")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("rsvd0")
	.dwattr $C$DW$372, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$372, DW_AT_bit_size(0x02)
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$372, DW_AT_decl_column(0x0d)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$373, DW_AT_name("NEST_MODE")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("NEST_MODE")
	.dwattr $C$DW$373, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$373, DW_AT_bit_size(0x02)
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$373, DW_AT_decl_column(0x0d)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$374, DW_AT_name("rsvd4")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("rsvd4")
	.dwattr $C$DW$374, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$374, DW_AT_bit_size(0x1c)
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$374, DW_AT_decl_column(0x0d)


$C$DW$19	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$19, DW_AT_name("_ZN7pruIntc5__C15Ut_aSERKS1_")
	.dwattr $C$DW$19, DW_AT_declaration
	.dwattr $C$DW$19, DW_AT_TI_symbol_name("_ZN7pruIntc5__C15Ut_aSERKS1_")
	.dwattr $C$DW$19, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$375	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$93)

	.dwendtag $C$DW$19

	.dwattr $C$DW$T$95, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$T$95, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$95, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$95

$C$DW$T$92	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$95)

$C$DW$T$93	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$93, DW_AT_address_class(0x20)

$C$DW$T$577	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$577, DW_AT_type(*$C$DW$T$95)

$C$DW$T$91	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$T$91, DW_AT_address_class(0x20)


$C$DW$T$94	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$376	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$93)

	.dwendtag $C$DW$T$94


$C$DW$T$100	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$377, DW_AT_name("EN_HINT_ANY")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("EN_HINT_ANY")
	.dwattr $C$DW$377, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$377, DW_AT_bit_size(0x01)
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$377, DW_AT_decl_column(0x0d)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$378, DW_AT_name("rsvd1")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("rsvd1")
	.dwattr $C$DW$378, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$378, DW_AT_bit_size(0x1f)
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$378, DW_AT_decl_column(0x0d)


$C$DW$20	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$20, DW_AT_name("_ZN7pruIntc5__C16Ut_aSERKS1_")
	.dwattr $C$DW$20, DW_AT_declaration
	.dwattr $C$DW$20, DW_AT_TI_symbol_name("_ZN7pruIntc5__C16Ut_aSERKS1_")
	.dwattr $C$DW$20, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$379	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$98)

	.dwendtag $C$DW$20

	.dwattr $C$DW$T$100, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$100

$C$DW$T$97	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$100)

$C$DW$T$98	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$98, DW_AT_address_class(0x20)

$C$DW$T$584	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$584, DW_AT_type(*$C$DW$T$100)

$C$DW$T$96	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$96, DW_AT_address_class(0x20)


$C$DW$T$99	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$380	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$98)

	.dwendtag $C$DW$T$99


$C$DW$T$105	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$105, DW_AT_byte_size(0x04)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$381, DW_AT_name("GLB_NEST_LEVEL")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
	.dwattr $C$DW$381, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$381, DW_AT_bit_size(0x09)
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$381, DW_AT_decl_column(0x0d)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$382, DW_AT_name("rsvd9")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("rsvd9")
	.dwattr $C$DW$382, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$382, DW_AT_bit_size(0x16)
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$382, DW_AT_decl_column(0x0d)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$383, DW_AT_name("AUTO_OVERRIDE")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
	.dwattr $C$DW$383, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$383, DW_AT_bit_size(0x01)
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$383, DW_AT_decl_column(0x0d)


$C$DW$21	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$21, DW_AT_name("_ZN7pruIntc5__C17Ut_aSERKS1_")
	.dwattr $C$DW$21, DW_AT_declaration
	.dwattr $C$DW$21, DW_AT_TI_symbol_name("_ZN7pruIntc5__C17Ut_aSERKS1_")
	.dwattr $C$DW$21, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$384	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$103)

	.dwendtag $C$DW$21

	.dwattr $C$DW$T$105, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$T$105, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$105, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$105

$C$DW$T$102	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$105)

$C$DW$T$103	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$T$103, DW_AT_address_class(0x20)

$C$DW$T$591	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$591, DW_AT_type(*$C$DW$T$105)

$C$DW$T$101	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$T$101, DW_AT_address_class(0x20)


$C$DW$T$104	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$385	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$103)

	.dwendtag $C$DW$T$104


$C$DW$T$110	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$110, DW_AT_byte_size(0x04)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$386, DW_AT_name("STS_SET_IDX")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("STS_SET_IDX")
	.dwattr $C$DW$386, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$386, DW_AT_bit_size(0x0a)
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x66)
	.dwattr $C$DW$386, DW_AT_decl_column(0x0d)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$387, DW_AT_name("rsvd10")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("rsvd10")
	.dwattr $C$DW$387, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$387, DW_AT_bit_size(0x16)
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x67)
	.dwattr $C$DW$387, DW_AT_decl_column(0x0d)


$C$DW$22	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$22, DW_AT_name("_ZN7pruIntc5__C18Ut_aSERKS1_")
	.dwattr $C$DW$22, DW_AT_declaration
	.dwattr $C$DW$22, DW_AT_TI_symbol_name("_ZN7pruIntc5__C18Ut_aSERKS1_")
	.dwattr $C$DW$22, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$388	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$108)

	.dwendtag $C$DW$22

	.dwattr $C$DW$T$110, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$T$110, DW_AT_decl_line(0x65)
	.dwattr $C$DW$T$110, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$110

$C$DW$T$107	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$110)

$C$DW$T$108	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$108, DW_AT_address_class(0x20)

$C$DW$T$598	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$598, DW_AT_type(*$C$DW$T$110)

$C$DW$T$106	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$106, DW_AT_address_class(0x20)


$C$DW$T$109	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$389	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$108)

	.dwendtag $C$DW$T$109


$C$DW$T$115	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$115, DW_AT_byte_size(0x04)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$390, DW_AT_name("STS_CLR_IDX")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("STS_CLR_IDX")
	.dwattr $C$DW$390, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$390, DW_AT_bit_size(0x0a)
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x71)
	.dwattr $C$DW$390, DW_AT_decl_column(0x0d)

$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$391, DW_AT_name("rsvd10")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("rsvd10")
	.dwattr $C$DW$391, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$391, DW_AT_bit_size(0x16)
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$391, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x72)
	.dwattr $C$DW$391, DW_AT_decl_column(0x0d)


$C$DW$23	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$23, DW_AT_name("_ZN7pruIntc5__C19Ut_aSERKS1_")
	.dwattr $C$DW$23, DW_AT_declaration
	.dwattr $C$DW$23, DW_AT_TI_symbol_name("_ZN7pruIntc5__C19Ut_aSERKS1_")
	.dwattr $C$DW$23, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$392	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$113)

	.dwendtag $C$DW$23

	.dwattr $C$DW$T$115, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$T$115, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$115, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$115

$C$DW$T$112	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$115)

$C$DW$T$113	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$T$113, DW_AT_address_class(0x20)

$C$DW$T$605	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$605, DW_AT_type(*$C$DW$T$115)

$C$DW$T$111	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$T$111, DW_AT_address_class(0x20)


$C$DW$T$114	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$393	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$113)

	.dwendtag $C$DW$T$114


$C$DW$T$120	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$120, DW_AT_byte_size(0x04)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$394, DW_AT_name("EN_SET_IDX")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("EN_SET_IDX")
	.dwattr $C$DW$394, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$394, DW_AT_bit_size(0x0a)
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$394, DW_AT_decl_column(0x0d)

$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$395, DW_AT_name("rsvd10")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("rsvd10")
	.dwattr $C$DW$395, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$395, DW_AT_bit_size(0x16)
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$395, DW_AT_decl_column(0x0d)


$C$DW$24	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$24, DW_AT_name("_ZN7pruIntc5__C20Ut_aSERKS1_")
	.dwattr $C$DW$24, DW_AT_declaration
	.dwattr $C$DW$24, DW_AT_TI_symbol_name("_ZN7pruIntc5__C20Ut_aSERKS1_")
	.dwattr $C$DW$24, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$396	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$118)

	.dwendtag $C$DW$24

	.dwattr $C$DW$T$120, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$T$120, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$120, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$120

$C$DW$T$117	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$120)

$C$DW$T$118	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$T$118, DW_AT_address_class(0x20)

$C$DW$T$612	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$612, DW_AT_type(*$C$DW$T$120)

$C$DW$T$116	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$T$116, DW_AT_address_class(0x20)


$C$DW$T$119	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C_plus_plus)
$C$DW$397	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$118)

	.dwendtag $C$DW$T$119


$C$DW$T$125	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$125, DW_AT_byte_size(0x04)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$398, DW_AT_name("EN_CLR_IDX")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("EN_CLR_IDX")
	.dwattr $C$DW$398, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$398, DW_AT_bit_size(0x0a)
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x87)
	.dwattr $C$DW$398, DW_AT_decl_column(0x0d)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$399, DW_AT_name("rsvd10")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("rsvd10")
	.dwattr $C$DW$399, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$399, DW_AT_bit_size(0x16)
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x88)
	.dwattr $C$DW$399, DW_AT_decl_column(0x0d)


$C$DW$25	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$25, DW_AT_name("_ZN7pruIntc5__C21Ut_aSERKS1_")
	.dwattr $C$DW$25, DW_AT_declaration
	.dwattr $C$DW$25, DW_AT_TI_symbol_name("_ZN7pruIntc5__C21Ut_aSERKS1_")
	.dwattr $C$DW$25, DW_AT_type(*$C$DW$T$121)
	.dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$400	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$123)

	.dwendtag $C$DW$25

	.dwattr $C$DW$T$125, DW_AT_decl_file("/home/elcritch/projects/bessel/pru_example/deps/bbb/nerves_pru_support/priv/pru/include/am335x/pru_intc.h")
	.dwattr $C$DW$T$125, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$125, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$125

$C$DW$T$122	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$125)

$C$DW$T$123	.dwtag  DW_TAG_reference_type
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$T$123, DW_AT_address_class(0x20)

